## Задача №4:
#
# В соседнем районе рождественские эльфы готовят подарки для жителей города.
# Для каждого подарка (файл data/4.txt) нужно найти сколько оберточной бумаги потребуется.
# Формула рассчета: 2*ш*д + 2*д*в + 2*в*ш + площадь наименьшей стороны
# Например, на подарок размером 2х3х4 требуется 2*6 + 2*12 + 2*8 = 52 + 6 кв. см.
#
# Сколько всего оберточной бумаги нужно купить эльфам?
#
## Требования к решению:
# - Входные данные находятся в файле data/4.txt
# - В значениях данные длины, ширины и высоты не упорядочены и могут идти в любом порядке, однако
# длина всегда наименьшее число из трех, высота - среднее, ширина - самое большое.
# - Результат должен быть выведен в консоль командой puts
#
#
## Решение:
res = File.foreach('data/4.txt').map { |line| line.split('x').map(&:to_i) }
s_arr = []
res.each do |i|
  s_arr << i.sort
end

sum = 0
s_arr.each do |i|
  sum += ((2 * i[2] * i[0]) + (2 * i[0] * i[1]) + (2 * i[1] * i[2])) + i[0]**2
end
puts sum
